Repository: LordJmw/Mobile-Back-End-Ba-Fang-Lai-Cai
Catalog: lib/l10n/app_*.arb
Languages: id

source: Home
id: Beranda

source: Best Rated This Week!
id: Rating Terbaik Minggu ini!

source: View Category Page
id: Lihat Halaman Kategori

# portfolioAndReview
source: Portfolio & Reviews
id: Portofolio & Review

# inspirationAndFeed
source: Inspiration & Feed
id: Inspirasi & Feed

# categoryPhotography
source: Photography & Videography
id: Fotografi & Videografi

# categoryDecorVenue
source: Decoration & Venue
id: Dekorasi & Venue

# categoryTechEventProduction
source: Technology & Event Production
id: Teknologi & Produksi Acara

# categoryTransportationLogistics
source: Transportation & Logistics
id: Transportasi & Logistik

# categorySupportServices
source: Other Support Services
id: Layanan Pendukung Lainnya

# ourProduct
source: Our Products
id: Produk Kami

source: Search vendor or category...
id: Cari penyedia jasa atau kategori...

source: No results
id: Tidak ada hasil

source: User Profile
id: Profil Pengguna

source: My Profile
id: Profil Saya

source: Your Purchase History
id: Riwayat Pembelian Anda

source: No purchases yet.
id: Belum ada pembelian.

# pleaseBuyPackage
source: Please buy a package from a vendor.
id: Silakan beli paket dari vendor.

# failedToLoadCustomer
source: Failed to load customer data
id: Tidak dapat memuat data customer

source: Customer not found
id: Customer tidak ditemukan

source: Profile updated successfully
id: Profil berhasil diupdate

source: Failed to update profile
id: Gagal mengupdate profil

source: Order updated successfully
id: Pesanan berhasil diupdate

source: Order deleted successfully
id: Pesanan berhasil dihapus

source: Full Name
id: Nama Lengkap

source: Phone Number
id: Nomor Telepon

source: Address
id: Alamat

source: Event Date
id: Tanggal Acara

source: Event Location
id: Lokasi

source: Special Notes
id: Catatan Khusus

source: Enter event location
id: Masukkan lokasi acara

source: Add notes
id: Tambahkan catatan

# requiredFields
source: Name, email, and phone must be filled
id: Nama, email, dan telepon harus diisi

# locationAndDateRequired
source: Location and date are required
id: Lokasi dan tanggal harus diisi

source: Delete
id: Hapus

source: Edit Order
id: Edit Pesanan

source: Delete Order
id: Hapus Pesanan

# confirmDelete
source: Are you sure you want to delete the order from?
id: Yakin ingin menghapus pesanan dari?

# purchaseDate
source: Purchased on
id: Dibeli pada

# eventDateLabel
source: Event date
id: Tanggal acara

# locationLabel
source: Location
id: Lokasi

# notesLabel
source: Notes
id: Catatan

source: Try Again
id: Coba Lagi

source: Unknown vendor
id: Vendor tidak diketahui

source: Package
id: Paket

# categoryVendor
source: Vendor Categories
id: Kategori Vendor

source: Category Page
id: Halaman Kategori

source: Price Range
id: Rentang Harga

# fiveStars
source: 5 stars
id: 5 bintang

# starsAndAbove
source: {count} stars and above
id: {count} bintang ke atas

# allRatings
source: All
id: Semua

source: Service Type
id: Jenis Layanan

# noProductsMatchFilter
source: No products match the current filter!
id: Tidak ada Produk sesuai filter saat ini!

source: Payment Page
id: Halaman Pembayaran

source: Order Form
id: Form Pemesanan

source: Selected Package
id: Paket yang Dipilih

source: No packages available
id: Tidak ada paket tersedia

source: Select Package
id: Pilih Paket

# addSpecialNotes
source: Add notes or special requests
id: Tambahkan catatan atau permintaan khusus

source: Price Summary
id: Ringkasan Harga

source: Total Price
id: Total harga

source: Pay Now
id: Bayar Sekarang

source: Loading data...
id: Sedang memuat data...

# loginAsCustomerToBuy
source: Login as customer to purchase a package
id: Login sebagai customer untuk dapat membeli paket

source: Select event date first
id: Pilih tanggal acara terlebih dahulu

# selectPackageFirst
source: Select a package first
id: Pilih paket terlebih dahulu

# packageNotAvailable
source: Package not available. Please choose another package.
id: Paket tidak tersedia. Silakan pilih paket lain.

# purchaseSuccessful
source: Purchase successful! The package has been added to your profile.
id: Pembelian berhasil! Paket telah ditambahkan ke profil Anda.

source: App Settings
id: Pengaturan Aplikasi

# customizeYourExperience
source: Customize your app experience
id: Sesuaikan pengalaman aplikasi Anda

source: MAIN SETTINGS
id: PENGATURAN UTAMA

source: Notifications
id: Notifikasi

source: Enabled
id: Diaktifkan

source: Disabled
id: Dinonaktifkan

source: Theme
id: Tema

source: Automatic
id: Otomatis

# languageChangedTo
source: Language changed to {language}
id: Bahasa diubah ke {language}

source: ABOUT APP
id: TENTANG APLIKASI

source: About Application
id: Tentang Aplikasi

# appInformation
source: Information about {appName}
id: Informasi tentang {appName}

source: App Version
id: Versi Aplikasi

source: Latest
id: Terbaru

source: Terms & Privacy
id: Ketentuan & Privasi

source: Read our policies
id: Baca kebijakan kami

source: Choose Language
id: Pilih Bahasa

# indonesianLanguage
source: Indonesian
id: Bahasa Indonesia

# indonesia
source: Indonesian
id: Indonesia

# aboutAppDescription1
source: EventHub is an all-in-one platform to hire professional services for all your event needs.
id: EventHub adalah platform all-in-one untuk menyewa jasa profesional untuk berbagai kebutuhan event Anda.

# aboutAppDescription2
source: This application connects customers with trusted vendors in one easy-to-use place.
id: Aplikasi ini menghubungkan Customer dengan Vendor terpercaya dalam satu tempat yang mudah digunakan.

source: For Vendors
id: Untuk Vendor

# vendorDescription
source: Vendors can add and manage their service packages directly through the app, making it easier to reach more potential customers.
id: Vendor dapat menambah dan mengelola paket layanan mereka langsung melalui aplikasi, memudahkan dalam menjangkau lebih banyak customer potensial.

source: Terms of Service
id: Ketentuan Layanan

source: Privacy Policy
id: Kebijakan Privasi

source: Vendor Profile
id: Profil Vendor

# failedToLoadVendor
source: Failed to load vendor data
id: Tidak dapat memuat data vendor

# noDescription
source: No description yet
id: Belum ada deskripsi

source: Your Packages
id: Paket Anda

# priceNotSet
source: Not set
id: Belum diatur

source: No description available
id: Tidak ada deskripsi

source: Delete Confirmation
id: Konfirmasi Hapus

# confirmDeletePackage
source: Are you sure you want to delete the package '{package}'?
id: Apakah Anda yakin ingin menghapus paket '{package}'?

# packageDeletedSuccessfully
source: Package '{package}' deleted successfully.
id: Paket '{package}' berhasil dihapus.

source: Vendor not logged in.
id: Vendor tidak login.

source: No image selected.
id: Tidak ada gambar yang dipilih.

# profilePictureUpdated
source: Profile picture updated successfully.
id: Foto profil berhasil diperbarui.

# failedToUpdatePicture
source: Failed to update profile picture: {error}
id: Gagal memperbarui foto profil: {error}

source: Edit Package Price
id: Edit Harga Paket

source: Package Name
id: Nama Paket

# enterPackagePrice
source: Enter package price (example: 500000)
id: Masukkan harga paket (contoh: 500000)

# priceRequired
source: Price cannot be empty
id: Harga tidak boleh kosong

# enterValidPrice
source: Enter a valid price
id: Masukkan harga yang valid

# serviceDescription
source: Service Description (separate with commas)
id: Deskripsi Jasa (Pisahkan dengan koma)

# serviceExample
source: Example: Photographer, Videographer, Printed Album
id: Contoh: Fotografer, Videografer, Album Cetak

# serviceDescriptionRequired
source: Service description cannot be empty
id: Deskripsi jasa tidak boleh kosong

# useCommaSeparator
source: Use commas (,) to separate services
id: Gunakan koma (,) untuk memisahkan jasa

# packagePriceUpdated
source: Package price updated successfully!
id: Harga paket berhasil diperbarui!

source: Vendor Details
id: Detail Vendor

source: About
id: Tentang

# noDescriptionForVendor
source: No description for this vendor.
id: Belum ada deskripsi untuk vendor ini.

source: Order Now
id: Pesan Sekarang

source: Contact
id: Kontak

source: Client Reviews
id: Ulasan Klien

source: per event
id: per acara

source: Vendor not found in database
id: Vendor tidak ditemukan di database

# failedToLoadVendorData
source: Failed to load vendor data: {error}
id: Gagal memuat data vendor: {error}

# packagesDeletedByVendor
source: Packages have been deleted by the vendor.
id: Paket sudah dihapus oleh vendor.

# thisPackageDeletedByVendor
source: This package has been deleted by the vendor.
id: Paket ini sudah dihapus oleh vendor.

source: Delete Account
id: Hapus Akun

# deleteAccountWarning
source: Are you sure you want to delete your account? This action cannot be undone.
id: Apakah Anda yakin ingin menghapus akun Anda? Tindakan ini tidak dapat dibatalkan.

# deleteAccountConsequences
source: All your data, orders, and preferences will be permanently deleted.
id: Semua data Anda, pesanan, dan preferensi akan dihapus secara permanen.

# enterPasswordToConfirm
source: Enter your password to confirm:
id: Masukkan password Anda untuk konfirmasi:

source: Enter your password
id: Masukkan password Anda

source: Deleting account...
id: Menghapus akun...

# pleaseEnterPassword
source: Please enter your password
id: Silakan masukkan password Anda

# wrongPassword
source: Incorrect password. Please try again.
id: Password salah. Silakan coba lagi.

# requiresRecentLogin
source: For security reasons, please log in again before deleting your account.
id: Untuk alasan keamanan, silakan login ulang sebelum menghapus akun.

# tooManyAttempts
source: Too many attempts. Please try again later.
id: Terlalu banyak percobaan. Silakan coba lagi nanti.

# deleteAccountFailed
source: Failed to delete account. Please try again.
id: Gagal menghapus akun. Silakan coba lagi.

source: Account deleted successfully.
id: Akun berhasil dihapus.

# permanentDeleteWarning
source: Permanently delete your account and data
id: Hapus akun dan data Anda secara permanen

source: Danger Zone
id: Zona Bahaya

source: Invite Friends
id: Undang Teman

# inviteFriendsDescription
source: Invite friends to join the app
id: Undang teman untuk bergabung

# permissionDenied
source: Permission denied to access contacts
id: Izin akses kontak ditolak

source: No contacts found
id: Tidak ada kontak ditemukan

source: No phone number
id: Tidak ada nomor telepon

# chooseContactToInvite
source: Select a contact to invite
id: Pilih kontak yang ingin diundang

# inviteButton
source: Invite
id: Undang

# inviteTitle
source: Invite {name}
id: Undang {name}

# inviteMessage
source: Do you want to invite {name} to join this app?
id: Apakah Anda ingin mengundang {name} untuk bergabung di aplikasi ini?

source: Send Invitation
id: Kirim Undangan

# inviteSuccess
source: Invitation has been sent to {name}
id: Undangan telah dikirim ke {name}

# notifPermissionTitle
source: Enable Notifications
id: Aktifkan Notifikasi

# notifPermissionDesc
source: We need notification permission to remind you about your orders and inform you about latest promotions.
id: Kami memerlukan izin notifikasi untuk mengingatkan pesanan Anda dan memberi tahu promo terbaru.

# notifPermissionAllow
source: Allow
id: Izinkan

# notifPermissionCancel
source: Cancel
id: Batal

# notificationAppointmentTitle
source: Order Reminder
id: Pengingat Pesanan

# notificationAppointmentBody
source: You have an order for {packageName} today
id: Anda memiliki pesanan untuk {packageName} pada hari ini

source: Welcome!
id: Selamat Datang!

source: Login to continue
id: Masuk untuk melanjutkan

# emailRequired
source: Email is required
id: Email wajib diisi

source: Invalid email format
id: Format email tidak valid

# passwordRequired
source: Password is required
id: Password wajib diisi

# passwordMinLength
source: Minimum 6 characters
id: Minimal 6 karakter

source: Login
id: Masuk

# noAccountRegister
source: Don't have an account? Register
id: Belum punya akun? Daftar

source: Login as Customer
id: Login sebagai Customer

# loginSuccess
source: Login successful!
id: Login berhasil!

# invalidCredentials
source: Incorrect email or password!
id: Email atau password salah!

source: Login as Vendor
id: Login sebagai Vendor

# registerCreateTitle
source: Create New Customer Account
id: Buat Akun Customer Baru

# registerCreateSubtitle
source: Fill in the details to register as a customer
id: Isi data untuk mendaftar Customer

# registerFullName
source: Full Name
id: Nama Lengkap

# registerConfirmPassword
source: Confirm Password
id: Konfirmasi Password

# registerPhoneNumber
source: Phone Number
id: Nomor Telepon

# registerAddress
source: Full Address
id: Alamat Lengkap

# registerButton
source: Register
id: Daftar

# registerHaveAccount
source: Already have an account? Login
id: Sudah punya akun? Masuk

# errorNameRequired
source: Name is required
id: Nama wajib diisi

# errorEmailRequired
source: Email is required
id: Email wajib diisi

# errorEmailInvalid
source: Invalid email format
id: Format email tidak valid

# errorPasswordRequired
source: Password is required
id: Password wajib diisi

# errorPasswordMinLength
source: Minimum 6 characters
id: Minimal 6 karakter

# errorConfirmPasswordRequired
source: Confirm password is required
id: Konfirmasi password wajib diisi

# errorPasswordNotMatch
source: Passwords do not match
id: Password tidak sama

# errorPhoneRequired
source: Phone number is required
id: Nomor telepon wajib diisi

# errorPhoneOnlyNumber
source: Phone number must be numeric
id: Nomor telepon hanya boleh angka

# errorPhoneMinDigit
source: Phone number must be at least 10 digits
id: Nomor telepon minimal 10 digit

# errorAddressRequired
source: Address is required
id: Alamat wajib diisi

# permissionContactRequired
source: Contact permission is required for registration.
id: Izin kontak diperlukan untuk registrasi.

# permissionContactDenied
source: Contact permission denied. Please enable it manually in Settings.
id: Izin kontak ditolak. Aktifkan secara manual di Pengaturan.

# permissionContactBlocked
source: Contact permission blocked. Please enable it manually in Settings.
id: Izin kontak diblokir. Aktifkan secara manual di Pengaturan.

# registerSuccess
source: Account registered successfully!
id: Akun berhasil didaftarkan!

# registerEmailUsed
source: This email is already registered
id: Email ini sudah terdaftar

# registerGeneralError
source: An error occurred: {error}
id: Terjadi kesalahan: {error}

# registerVendorTitle
source: Create New Vendor Account
id: Buat Akun Vendor Baru

# registerVendorSubtitle
source: Fill in the details to register as a vendor
id: Isi data untuk mendaftar Vendor

# registerVendorName
source: Store Name
id: Nama Toko

# registerVendorConfirmPassword
source: Confirm Password
id: Konfirmasi Password

# registerVendorPhone
source: Phone Number
id: Nomor Telepon

# registerVendorAddress
source: Store Address
id: Alamat Toko

# registerVendorButton
source: Register Vendor
id: Daftar Vendor

# basicPriceRequired
source: Basic package price is required
id: Harga Basic wajib diisi

# premiumPriceRequired
source: Premium package price is required
id: Harga Premium wajib diisi

# customPriceRequired
source: Custom package price is required
id: Harga Custom wajib diisi

# priceInvalid
source: Invalid price
id: Harga tidak valid

# priceTooHigh
source: Price cannot exceed 10 million
id: Harga tidak boleh lebih dari 10 juta

# paketBasic
source: Basic Package
id: Paket Basic

# paketPremium
source: Premium Package
id: Paket Premium

# paketCustom
source: Custom Package
id: Paket Custom

# hargaBasic
source: Basic Price
id: Harga Basic

# jasaBasic
source: Basic Service
id: Jasa Basic

# hargaPremium
source: Premium Price
id: Harga Premium

# jasaPremium
source: Premium Service
id: Jasa Premium

# hargaCustom
source: Custom Price
id: Harga Custom

# jasaCustom
source: Custom Service
id: Jasa Custom

# hargaBasicWajibDiisi
source: Basic price is required
id: Harga Basic wajib diisi

# jasaBasicWajibDiisi
source: Basic service is required
id: Jasa Basic wajib diisi

# hargaPremiumWajibDiisi
source: Premium price is required
id: Harga Premium wajib diisi

# jasaPremiumWajibDiisi
source: Premium service is required
id: Jasa Premium wajib diisi

# hargaCustomWajibDiisi
source: Custom price is required
id: Harga Custom wajib diisi

# jasaCustomWajibDiisi
source: Custom service is required
id: Jasa Custom wajib diisi

# hargaTidakValid
source: Price is not valid
id: Harga tidak valid

# hargaTidakBolehLebihDari10Juta
source: Price cannot exceed 10 million
id: Harga tidak boleh lebih dari 10 juta

# registerVendorSuccess
source: Vendor registered successfully!
id: Vendor berhasil didaftarkan!

# permissionContactRequiredTitle
source: Contact Permission Required
id: Izin Kontak Diperlukan

# permissionContactRequiredMessage
source: Allow contact access to continue.
id: Izinkan akses kontak untuk melanjutkan.

# cobaLagi
source: Try Again
id: Coba Lagi

# batal
source: Cancel
id: Batal

# permissionDitolakPermanenTitle
source: Permission Permanently Denied
id: Izin Ditolak Permanen

# permissionDitolakPermanenMessage
source: Enable contact access from settings.
id: Aktifkan akses kontak dari pengaturan.

# bukaPengaturan
source: Open Settings
id: Buka Pengaturan

# continueDialog
source: continue
id: lanjutkan

source: Permission Required
id: Izin Diperlukan

# pleaseAllowContactToRegister
source: Please allow contact access to register.
id: Silakan izinkan kontak agar bisa mendaftar.

source: Contact permission denied.
id: Izin kontak ditolak.

# contactPermissionBlocked
source: Contact permission blocked. Enable in Settings.
id: Izin kontak diblokir. Aktifkan di Pengaturan.

source: Search
id: Cari

source: Categories
id: Kategori

source: View All
id: Lihat Semua

source: Details
id: Detail

source: Price
id: Harga

source: Packages
id: Paket

source: Testimonials
id: Testimoni

source: Description
id: Deskripsi

source: Phone
id: Telepon

source: Buy Package
id: Beli Paket

source: Select Date
id: Pilih Tanggal

source: Location
id: Lokasi

source: Notes
id: Catatan

source: Submit
id: Kirim

source: Cancel
id: Batal

source: Profile
id: Profil

source: Edit Profile
id: Edit Profil

source: Settings
id: Pengaturan

source: Logout
id: Keluar

source: Language
id: Bahasa

source: Order History
id: Riwayat Pemesanan

source: Pending
id: Menunggu

source: Completed
id: Selesai

source: Failed
id: Gagal

source: Confirm
id: Konfirmasi

source: Invalid input
id: Input tidak valid

source: No data
id: Tidak ada data

source: Loading...
id: Memuat...

source: Save
id: Simpan
